>> ['add', '10', '12']
  >> add
  <<(['x', 'y'], ['+', 'x', 'y'], {})
  >> 10
  <<'10'
  >> 12
  <<'12'
  >> ['+', 'x', 'y']
    >> +
    <<'+'
    >> x
    <<'10'
    >> y
    <<'12'
  <<22
<<22
